#!/usr/bin/env bash
# Largely stolen from Mathias Bynens
# https://github.com/mathiasbynens/dotfiles

# Make sure we’re using the latest Homebrew
#update

# Upgrade any already-installed formulae
#upgrade

# Setup basic packages I always need
# zsh stuff
brew 'oh-my-posh'


# Setup nodejs
brew 'node'

# Setup nginx
#brew 'nginx'

# Setup vim using MacVim
#brew 'macvim', args--override-system-vim

# Install git trix
brew 'tig'

# Install tmux
brew 'tmux'

brew 'htop'

# Claude stuff
brew 'opencode'

# Run additional commands for sshfs
#sudo kextunload -b com.github.osxfuse.filesystems.osxfusefs
#sudo /bin/cp -RfX /usr/local/Cellar/osxfuse/2.6.2/Library/Filesystems/osxfusefs.fs /Library/Filesystems
#	sudo chmod +s /Library/Filesystems/osxfusefs.fs/Support/load_osxfusefs

# Install brew cask for apps
#tap 'homebrew/cask'

# Install apps using brew-cask
cask 'charles'
cask 'iterm2'
cask 'hazel'
cask 'dropbox'
cask 'alfred'
#cask 'slack'
cask 'visual-studio-code'

#Lets remap Caps Lock, shall we?
cask 'karabiner-elements'
cask 'hammerspoon'

#What are we? BROWSERS!
cask 'google-chrome'

cask 'spotify'
cask 'obsidian'
cask '1password'

cask 'ghostty'

#Work
#tap 'tap homebrew/versions'

#K8s
#brew 'kubernetes-cli'
#brew 'kubectx'

# Link applications correctly
#linkapps
